---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveDeleted
source: html/1ab4fea6-0712-146f-5bde-3a7f491de1bd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LevelFailures.StoryAboveDeleted Property

The level set as the Story Above for these levels is being deleted. This change will cause these levels to revert to the default Story Above.

## Syntax (C#)
```csharp
public static FailureDefinitionId StoryAboveDeleted { get; }
```